//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。

//以下为4个嫌疑犯的供词:

//A说：不是我。

//B说：是C。

//C说：是D。

//D说：C在胡说

//已知3个人说了真话，1个人说的是假话。

//现在请根据这些信息，写一个程序来确定到底谁是凶手


#include <stdio.h>


int main()
{
	int zuifang[4] = { 0 };//假设它们4个都不是凶手
	int i = 0;
	for (i = 0; i < 4; i++)//遍历他们每个人判断谁是凶手
	{
		zuifang[i] = 1;//假设一个人为凶手
		if ((zuifang[0] != 1) +//A说不是我
			(zuifang[2] == 1) +//B说是C
			(zuifang[3] == 1) +//C说是D
			(zuifang[3] != 1) == 3)//D说C在说胡话
		{
			break;//确定凶手跳出循环
		}
		zuifang[i] = 0;//不是凶手还它清白
	}
	printf("凶手是%c\n", 'A' + i);
	return 0;
}
